In [272]:
from sklearn import datasets
from sklearn.linear_model import LogisticRegression

In [273]:
import pandas as pd  
data = pd.read_csv("training_titanic_x_y_train.csv")

In [274]:
data['Sex'].replace('female',0,inplace=True)
data['Sex'].replace('male',1,inplace=True)
data['Embarked'].replace('S',0,inplace=True)
data['Embarked'].replace('C',1,inplace=True)
data['Embarked'].replace('Q',2,inplace=True)

In [275]:
data.drop(columns='Name',inplace = True)
data.drop(columns='Cabin',inplace = True)

In [276]:
data.drop(columns='Ticket',inplace = True)

In [277]:
data.reset_index(drop=True, inplace=True)

In [278]:
#data = data.style.hide_index()

In [279]:
import math
math.floor(data['Age'].mean())
data['Age'].fillna(math.floor(data['Age'].mean()), inplace=True)

In [280]:
data['Embarked'].fillna(1,inplace=True)

In [281]:
data.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [282]:
import numpy as np
y_train = np.array(data['Survived'])

data.drop(columns='Survived',inplace = True)
x_train = np.array(data)

In [283]:
x_train.shape

(668, 7)

In [254]:
#from sklearn import model_selection
#x_train , x_test , y_train , y_test = model_selection.train_test_split(x_train,y_train)

In [255]:
#x_train.shape,y_train.shape,x_test.shape,y_test.shape

((501, 7), (501,), (167, 7), (167,))

In [284]:
print(x_train[0])

[ 2.  0. 29.  1.  0. 26.  0.]

In [285]:
cls = LogisticRegression(multi_class='ovr')

In [286]:
cls.fit(x_train,y_train)

C:\Users\dexter\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='ovr', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [287]:
cls.score(x_train,y_train)

0.7919161676646707

In [289]:
test_data = pd.read_csv("test_titanic_x_test.csv")

In [290]:
test_data

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S
...,...,...,...,...,...,...,...,...,...,...
218,3,"Lindqvist, Mr. Eino William",male,20.0,1,0,STON/O 2. 3101285,7.9250,NaN,S
219,1,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.5500,B38,S
220,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
221,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.4500,NaN,S
222,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S

In [291]:
test_data['Sex'].replace('female',0,inplace=True)
test_data['Sex'].replace('male',1,inplace=True)
test_data['Embarked'].replace('S',0,inplace=True)
test_data['Embarked'].replace('C',1,inplace=True)
test_data['Embarked'].replace('Q',2,inplace=True)

In [292]:
test_data.drop(columns='Name',inplace = True)
test_data.drop(columns='Cabin',inplace = True)

In [293]:
test_data.drop(columns='Ticket',inplace = True)
test_data.reset_index(drop=True, inplace=True)

In [294]:
math.floor(test_data['Age'].mean())
test_data['Age'].fillna(math.floor(test_data['Age'].mean()), inplace=True)

In [295]:
test_data.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    1
dtype: int64

In [298]:
test_data['Embarked'].fillna(1,inplace=True)

In [299]:
test_data.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [300]:
test_data

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         2    1   8.0      1      1   36.7500       0.0
1         1    0  49.0      0      0   25.9292       0.0
2         3    1  29.0      0      0    7.7375       2.0
3         2    0  24.0      2      1   27.0000       0.0
4         1    1  36.0      0      0   26.2875       0.0
..      ...  ...   ...    ...    ...       ...       ...
218       3    1  20.0      1      0    7.9250       0.0
219       1    1  45.0      0      0   26.5500       0.0
220       1    0  17.0      1      0  108.9000       1.0
221       3    1  43.0      0      0    6.4500       0.0
222       2    1  36.5      0      2   26.0000       0.0

[223 rows x 7 columns]

In [301]:
test_data.shape

(223, 7)

In [307]:
prediction = cls.predict(test_data)

In [308]:
np.savetxt("test_titanic_y_test.csv",prediction , delimiter=",")